// Задача 1. Напишите программу, которая принимает на вход число N и выдает сумму чисел от 1 до числа N.
/*
int FindSum(int number)
{
    int sum = 0;

    for(int current = 1;current <= number; current++)
        sum +=current;


    return sum;
}

Console.Write("Input a number: ");
int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine($"Sum of numbers from 1 to {a} is {FindSum(a)}"); 
*/



// Задача 2. Напишите программу, которая принимает на вход число и выдает количество цифр в числе.
/*
int NumberOfDigit(int number)
{
    int count = 0;
    while(number != 0)
    {
        number /= 10;
        count++;
    }
    return count;
}
Console.WriteLine("Input number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Number of digit {NumberOfDigit(a)}");
*/



// Задача 3. Напишите программу, которая принимает на вход число N и выдает произведение чисел от 1 до N.
/*
long Factorial (int n)
{
    long sum = 1;
    for(int current = 1; current <= n; current++)
    {
        sum *= current;
    }
    return sum;
}
Console.Write("Input number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write($"Factorial = {Factorial(a)}");
*/



// Задача 4. 








